// Створити масив, довжину та елементи якого задає користувач. Після цього, відсортувати масив за зростанням. 
// Далі, видалити з масива елементи з 2-го по 4-й елемент. По мірі змін масива - виводити його вміст на сторінку.

let message = prompt("Введіть щонайменше 4 елементи через кому:");

if (message) {
  let myArr = message.split(",");

  if (myArr.length < 4) {
    alert("Недостатньо елементів! Потрібно ввести щонайменше 4.");
  } else {
    myArr.sort();
    console.log("Відсортований масив:", myArr);

    myArr.splice(1, 3);
    console.log("Після видалення:", myArr);

  }
} else {
  alert("Ввід скасовано або порожній.");
}
