// 1.Вивести числа від 20 до 30 через пробіл використовуючи крок 0,5 (20 20,5 21 21,5….)
// 2.Один доллар коштує 42 гривні. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
// 3.Дано ціле число (N). Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
// 4.Дано ціле число. З’ясувати, чи є воно простим
// Простим називається число, яке більше 1 та яке не має жодних інших дільників окрім 1 і самого себе). Наприклад, 5, 7, 13…
// 5.Дано ціле число. З’ясувати, чи можна це число отримати шляхом возведення числа 3 в деяку ступінь.
// Наприклад, числа 9, 81 можно отримати, а 13 - ні

// let a = "";

// for (i = 20; i <= 30; i+=0.5) {
//     a += i;
//     a += " ";
// }
// console.log(a);

// //____________________________________

// let a = 42;
// let result = "";

// for (i = 10; i <= 100; i+=10) {
//     result += i * a;
//     result += " ";
// }

// console.log(result);

// //____________________________________

// let n = parseInt(prompt("Enter integer number"));
// let a = "";

// for (i = 1; i <= 100; i++) {
//     let b = i * i;
//     if (b <= n) {
//         a += i;
//         a += " ";    }
// }
// console.log(a);
// //____________________________________

// let n = parseInt(prompt("Enter integer number"));
// let a = 0;

// if (a <= 1) {
//     console.log("Not a propriet number for task");
// }
// for (let i = 1; i <= n; i++){
//     if (n % i === 0) {
//         a++
//     }
// }
// if (a === 2) {
//     console.log("simple number");
// } else {
//     console.log("not simple number");
// }
// //____________________________________

// let n = parseInt(prompt("Enter integer number"));

// if ( n % 3 === 0 ) {
//     console.log("Yes");
// } else {
//     console.log("No");
// }



